benchmark/go-frameworks/results/20260924-102750/results/get/fasthttp/r1/40000.txt
Running 40s test @ http://10.128.0.4:8086/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.979ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.962ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.972ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.971ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.972ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.916ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.942ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.951ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.941ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.970ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.983ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.940ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.983ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.996ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.92ms  420.30us   7.21ms   65.54%
    Req/Sec     2.63k   219.68     3.80k    66.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.92ms
 75.000%    1.23ms
 90.000%    1.45ms
 99.000%    1.87ms
 99.900%    2.79ms
 99.990%    5.15ms
 99.999%    6.39ms
100.000%    7.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.084     0.000000            1         1.00
       0.370     0.100000       119983         1.11
       0.527     0.200000       239198         1.25
       0.664     0.300000       358076         1.43
       0.794     0.400000       477978         1.67
       0.918     0.500000       597185         2.00
       0.980     0.550000       657015         2.22
       1.041     0.600000       716214         2.50
       1.104     0.650000       776517         2.86
       1.166     0.700000       835655         3.33
       1.228     0.750000       895479         4.00
       1.260     0.775000       925741         4.44
       1.292     0.800000       955476         5.00
       1.325     0.825000       984991         5.71
       1.361     0.850000      1015167         6.67
       1.402     0.875000      1044708         8.00
       1.425     0.887500      1059388         8.89
       1.451     0.900000      1074328        10.00
       1.480     0.912500      1089088        11.43
       1.514     0.925000      1104175        13.33
       1.552     0.937500      1119146        16.00
       1.573     0.943750      1126385        17.78
       1.597     0.950000      1134010        20.00
       1.623     0.956250      1141530        22.86
       1.651     0.962500      1148831        26.67
       1.685     0.968750      1156358        32.00
       1.703     0.971875      1159952        35.56
       1.724     0.975000      1163759        40.00
       1.746     0.978125      1167403        45.71
       1.771     0.981250      1171202        53.33
       1.800     0.984375      1174954        64.00
       1.816     0.985938      1176805        71.11
       1.834     0.987500      1178672        80.00
       1.853     0.989062      1180495        91.43
       1.876     0.990625      1182396       106.67
       1.903     0.992188      1184205       128.00
       1.920     0.992969      1185162       142.22
       1.938     0.993750      1186082       160.00
       1.958     0.994531      1187002       182.86
       1.982     0.995313      1187952       213.33
       2.011     0.996094      1188860       256.00
       2.030     0.996484      1189318       284.44
       2.053     0.996875      1189811       320.00
       2.083     0.997266      1190259       365.71
       2.119     0.997656      1190715       426.67
       2.183     0.998047      1191181       512.00
       2.241     0.998242      1191416       568.89
       2.345     0.998437      1191648       640.00
       2.475     0.998633      1191881       731.43
       2.631     0.998828      1192114       853.33
       2.807     0.999023      1192348      1024.00
       2.925     0.999121      1192463      1137.78
       3.041     0.999219      1192579      1280.00
       3.191     0.999316      1192697      1462.86
       3.349     0.999414      1192813      1706.67
       3.575     0.999512      1192929      2048.00
       3.707     0.999561      1192987      2275.56
       3.845     0.999609      1193045      2560.00
       3.969     0.999658      1193106      2925.71
       4.159     0.999707      1193166      3413.33
       4.295     0.999756      1193220      4096.00
       4.391     0.999780      1193249      4551.11
       4.539     0.999805      1193278      5120.00
       4.679     0.999829      1193308      5851.43
       4.831     0.999854      1193337      6826.67
       4.987     0.999878      1193366      8192.00
       5.059     0.999890      1193381      9102.22
       5.171     0.999902      1193397     10240.00
       5.267     0.999915      1193410     11702.86
       5.371     0.999927      1193424     13653.33
       5.455     0.999939      1193439     16384.00
       5.539     0.999945      1193446     18204.44
       5.619     0.999951      1193453     20480.00
       5.679     0.999957      1193461     23405.71
       5.887     0.999963      1193468     27306.67
       5.955     0.999969      1193475     32768.00
       6.007     0.999973      1193479     36408.89
       6.055     0.999976      1193482     40960.00
       6.107     0.999979      1193486     46811.43
       6.179     0.999982      1193490     54613.33
       6.287     0.999985      1193493     65536.00
       6.323     0.999986      1193495     72817.78
       6.335     0.999988      1193497     81920.00
       6.395     0.999989      1193500     93622.86
       6.451     0.999991      1193501    109226.67
       6.503     0.999992      1193502    131072.00
       6.511     0.999993      1193503    145635.56
       6.519     0.999994      1193504    163840.00
       6.599     0.999995      1193505    187245.71
       6.663     0.999995      1193506    218453.33
       6.699     0.999996      1193507    262144.00
       6.699     0.999997      1193507    291271.11
       6.795     0.999997      1193509    327680.00
       6.795     0.999997      1193509    374491.43
       6.795     0.999998      1193509    436906.67
       6.795     0.999998      1193509    524288.00
       6.795     0.999998      1193509    582542.22
       6.823     0.999998      1193510    655360.00
       6.823     0.999999      1193510    748982.86
       6.823     0.999999      1193510    873813.33
       6.823     0.999999      1193510   1048576.00
       6.823     0.999999      1193510   1165084.44
       7.215     0.999999      1193511   1310720.00
       7.215     1.000000      1193511          inf
#[Mean    =        0.923, StdDeviation   =        0.420]
#[Max     =        7.212, Total count    =      1193511]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1597008 requests in 40.00s, 606.16MB read
Requests/sec:  39927.40
Transfer/sec:     15.15MB